# 1)მოიყვანეთ აბსოლიტურად ყველა მათემატიკურ  ოპერატორზე სამ სამი მაგალითი ძველებზეც და ახლებზეც
print(3+5)
print(4+10)
print(5+20)

print(4*5)
print(2*9)
print(4*7)

print(5-2)
print(10-7)
print(30-14)

print(20/5)
print(6/3)
print(121/11)

print(20//5)
print(6//3)
print(121//11)

print(3**2)
print(4**2)
print(10*2)

print(100%45)
print(20%14)
print(40%35)


# 2)კომენტარის სახით ახსენით თუ რა მათემატიკური ოპერაციები ვისწალეთ დღეს და 
# სიტყვიერად დაწერეთ თუ რას აკეთებენ ისინო
#ვისწავლეთ:  // - გაყოფა ოღონდ ტერმინალში ინტეჯერია პასუხი
# ** - ახარისხება
# % - ნაშთის ტერმინალში გამოტანა


# 3)დღეს ახსნილ მათემატიკურ ოპერატორებზე სათითაოდ მოიყვანეთ ხუთ ხუთი მაგალითი , 
# ანუ სულ 15 მაგალით უნდა გქონდეთ
print(15//5)
print(20//4)
print(40//8)
print(50//10)
print(60//6)

print(3**4)
print(4**2)
print(5**3)
print(12**2)
print(10**4)

print(200%100)
print(300%289)
print(10%4)
print(30%27)
print(40%17)


# 4)ქვემოთ მოცემულ მაგალითებს გვერდით მიუწერეთ პასუხები(დააკომენტარეთ ყველა და 
# კომენტარებად გქონდეთ მაგალითები:

#      15 / 3 = 5.0
#      20 / 4 = 5.0 
#      100 / 20 = 5.0

#      15 // 10 = 1
#      10 // 7 = 1
#      40 // 12 = 3

#      4 * 3 = 12
#      40 * 3 = 120
#      120 * 3 = 360

#      4 ** 3 = 64
#      10 ** 3 = 1000
#      2 ** 6 = 64
#      3 ** 4 = 81

#      10 % 7 = 3
#      3 % 2 = 1
#      50 % 25 = 0
#      14 % 11 = 3
#      110 % 50 = 10
     

# 5)კომენტარის სახით დაწერეთ თუ რაში ვიყენებთ სიებს,და რით განსხვავდებიან ისინი ცვლადებისაგან.

# სიებს ვიყენებთ, რათა სხვადასხვა ტიპის მონაცემები ერთობლივად შევინახოთ. ცვლადებში მხოლოდ
# ერთი მონაცემის ტიპი შეგვიძლია შევინახოთ, და არა სხვადასხვა ერთად.

# 6)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ სტრინგ ტიპის მონაცემები.
best_names= ["lizi","gvanca" , "barbare","nuca","nicole","mari"]

# 7)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ ინტეჯერ ტიპის მონაცემები
ages = [15, 16, 17, 18]

# 8)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ ფლოატ ტიპის მონაცემები
temperatures_this_week=[36.6, 35, 21, 30]

# 9)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ boolean ტიპის მონაცემები
booleans = [ True, False]

# 10)შექმენით სია,შეინახეთ ეს სია ცვლადში და ამ სიაში შეინახეთ ყველა მონაცემთა ტიპის მონაცემი
list_of_all_types = ["goga", 16, 37.5, True]

# ==============   Bonus   ==============

# 11)მომხმარებელს შემოატანინეთ ორი რიცხვი და მოახდინეთ ამ ორ რიცხხვზე დღეს ნასწავლი მათემატიკური ოპერაციები(თან დაპრინტეთ რომ ნახოთ შედეგი)
num = int(input("Enter the first number: "))
num_1 = int(input("Enter the second number: "))

print(num//num_1)
print(num**num_1)
print(num%num_1)

# 12)მომხმარებელს შემოატანინეთ ინტეჯერ ტიპის მონაცემი, შემდეგ შეამოწმეთ, თუ მომხმარებლის შემოყვანილი რიცხვი 
# არის 30 ზე მეტი და 100ზე ნაკლები დაუპრინტე --> "between 30 and 100", თუ ეს რიცხვი არის 100 ზე მეტი და 200 ზე ნაკლები დაუპრინტე --> "between 100 and 200" , სხვა დანარჩენ შემთხვევაში დაუპრინტე  --> "other number"
num_2 = input("Enter a number: ")
if 30<num_2<100:
    print( num_2," is between 30 and 100." )
elif 100<num_2<200:
    print(num_2, " is between 100 and 200." )
else:
    print("Its another number.")


# 13)შექმენი 5 ცვლადი შეინახე განსხვავებული ტიპის მონაცემები და დაპრინტე მათი ტიპები(გამოიყენეტ ნასწავლი ფუნქცია)
name = input("enter your name: ")
age = int(input("enter your age"))
height = int(input("enter ur height: "))
pi = float(input("enter the first 2 digits of pi: "))
quest = bool(input("Mount Everest is the tallest mountain on Earth.(True / False): "))

print(type(name))
print(type(age))
print(type(height))
print(type(pi))
print(type(quest))


# 14)while ციკლის დახმარებით გამოიტანეთ რიცხვები 50 დან 100 მდე 5 ის გამოტოვებით --> 50 55 60 ...
Num = 50
while Num<100:
    print(Num)
    Num +=5

# 15)for ციკლის დახმარებით გამოიტანეთ რიცხვები 40 დან 90 მდე 3 ის გამოტოვებით -- > 40 43 46 ...
for i in range(40,90,3):
    print(i)

# 16)გამოიტანე შენი სახელი და გვარი 15 ჯერ,გააკეთე ორივე ვარიანტით როგორც for ასევე while loop ის დახმარებით
num_2 = 0
while num_2<15:
    print('lizi')
    num_2 += 1

# 17)
# შექმენი ცვლადი სადაც შეინახავ შენს სახელს
# შექმენი ცვლადი სადაც შეინახავ შენს გვარს
# მომხმარებელს შემოატანინეთ სახელი
# თუ მომხმარებელმა შემოიტანა იგივე სახელი რაც შენ გქვია მაშინ:
#       მომხმარებელს შემოატანინე გვარი
#       თუ მომხმარებლის შემოტანილი გვარი დაემთხვა შენს გვარს
#             დაპრინტე --> same name and surname
#       სხვა შემთხვევაში
#             დაპრინტე -- > same name but different surname
# სხვა შემთხვევაშში(ანუ თუ მომხმარებელი თავიდანვე შემოიყვანს არასწორ სახელს)
#     დაპრინტე --> aqedan moshordi

name_1 = 'lizi'
last_name = 'gugunishvili'
name_2 = input('enter your name: ')

if name_1==name_2:
    last_name_2 = input('enter your last name: ')
    if last_name == last_name_2:
        print('we have the same names and surnames')
    else:
        print('we have the same names but different surnames')
else:
    print('get out lmao')


# 18)
# შექმენი ცვლადი სადაც შეინახავ პაროლს
# მომხმარებელს შემოატანინე პაროლი
# სანამ პირობა არის ჭეშმარიტი(True)
#       თუ მომხმარებლის პაროლი დაემთხვა შენს პაროლს:
#             დაპრინტე --> გამოიცანი
#              break
#       სხვა შემთხვევაში:
#           თავიდან გაუმეორე რომ შემოიყვანოს პაროლი

while True:
    password = 'pass123'
    Pass = input('enter your password: ')
    if password==Pass:
        print('You guessed it!')
        break
    else:
        print('get outt')