# 1)შექმენით 10 ელემენტიანი სია, და ამ სიიდან ბოლო 5 ელემენტი გამოიტანეთ დადებითი სლაისინგით
list = [1,2,3,4,5,6,7,8,9,10]
print(list[4:11])

# 2)შექმენით 20 ელემენტიანი სია, და ამ სიიდან პირველი 11 ელემენტი გამოიტანეთ 
# ყაროფიტითი ინდექსებით
list1 = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]

print(list1[-20:-9])

# 3)შექმენით 12 ელემენტიანი სია, და მომხარებელს შემოატანინე რიცხვი, შემდეგ 2 იდან მომხარებლის შემოტანილ რიცხვამდე გამოიტანე ყველა ელემენტი

list2= [1,2,3,4,5,6,7,8,9,10,11,12]
num = int(input("Enter a number (3-12): "))

print(list2[2:num])
